#+TITLE: 系统管理工具
#+AUTHOR: lujun9972
#+TAGS: linux
#+DATE: [2017-01-14 Sat 22:20]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil
#+PROPERTY: header-args:shell :exports both :results org

** lsmod命令: 显示所有已加载模块信息
其显示的信息与 =/proc/modules= 的内容相同

#+BEGIN_SRC sh
  lsmod
#+END_SRC

#+RESULTS:
| Module              |    Size | Used | by                                                                        |
| lib80211_crypt_ccmp |   16384 |    2 |                                                                           |
| mousedev            |   20480 |    0 |                                                                           |
| ipw2200             |  135168 |    0 |                                                                           |
| libipw              |   32768 |    1 | ipw2200                                                                   |
| gpio_ich            |   16384 |    0 |                                                                           |
| iTCO_wdt            |   16384 |    0 |                                                                           |
| iTCO_vendor_support |   16384 |    1 | iTCO_wdt                                                                  |
| pcmcia              |   49152 |    0 |                                                                           |
| i915                | 1163264 |    2 |                                                                           |
| ppdev               |   20480 |    0 |                                                                           |
| lib80211            |   16384 |    2 | libipw,lib80211_crypt_ccmp                                                |
| evdev               |   20480 |    5 |                                                                           |
| yenta_socket        |   40960 |    0 |                                                                           |
| snd_intel8x0        |   32768 |    0 |                                                                           |
| pcmcia_rsrc         |   20480 |    1 | yenta_socket                                                              |
| pcspkr              |   16384 |    0 |                                                                           |
| input_leds          |   16384 |    0 |                                                                           |
| cfg80211            |  458752 |    2 | ipw2200,libipw                                                            |
| drm_kms_helper      |  114688 |    1 | i915                                                                      |
| mac_hid             |   16384 |    0 |                                                                           |
| i2c_i801            |   24576 |    0 |                                                                           |
| drm                 |  249856 |    3 | i915,drm_kms_helper                                                       |
| i2c_smbus           |   16384 |    1 | i2c_i801                                                                  |
| snd_intel8x0m       |   20480 |    0 |                                                                           |
| pcmcia_core         |   20480 |    3 | yenta_socket,pcmcia,pcmcia_rsrc                                           |
| snd_ac97_codec      |   98304 |    2 | snd_intel8x0m,snd_intel8x0                                                |
| psmouse             |  126976 |    0 |                                                                           |
| lpc_ich             |   20480 |    0 |                                                                           |
| rng_core            |   16384 |    0 |                                                                           |
| syscopyarea         |   16384 |    1 | drm_kms_helper                                                            |
| thinkpad_acpi       |   69632 |    0 |                                                                           |
| tg3                 |  155648 |    0 |                                                                           |
| ptp                 |   20480 |    1 | tg3                                                                       |
| pps_core            |   20480 |    1 | ptp                                                                       |
| libphy              |   40960 |    1 | tg3                                                                       |
| snd_pcm             |   81920 |    3 | snd_intel8x0m,snd_ac97_codec,snd_intel8x0                                 |
| snd_timer           |   28672 |    1 | snd_pcm                                                                   |
| sysfillrect         |   16384 |    1 | drm_kms_helper                                                            |
| ac97_bus            |   16384 |    1 | snd_ac97_codec                                                            |
| nvram               |   16384 |    1 | thinkpad_acpi                                                             |
| parport_pc          |   28672 |    0 |                                                                           |
| parport             |   40960 |    2 | parport_pc,ppdev                                                          |
| intel_agp           |   20480 |    0 |                                                                           |
| intel_gtt           |   20480 |    2 | intel_agp,i915                                                            |
| sysimgblt           |   16384 |    1 | drm_kms_helper                                                            |
| snd                 |   57344 |    6 | snd_intel8x0m,snd_ac97_codec,snd_timer,thinkpad_acpi,snd_intel8x0,snd_pcm |
| thermal             |   20480 |    0 |                                                                           |
| agpgart             |   32768 |    3 | intel_agp,intel_gtt,drm                                                   |
| fb_sys_fops         |   16384 |    1 | drm_kms_helper                                                            |
| i2c_algo_bit        |   16384 |    1 | i915                                                                      |
| soundcore           |   16384 |    1 | snd                                                                       |
| rfkill              |   20480 |    4 | thinkpad_acpi,cfg80211                                                    |
| battery             |   16384 |    0 |                                                                           |
| fjes                |   28672 |    0 |                                                                           |
| ac                  |   16384 |    0 |                                                                           |
| shpchp              |   32768 |    0 |                                                                           |
| nsc_ircc            |   24576 |    0 |                                                                           |
| irda                |  151552 |    1 | nsc_ircc                                                                  |
| video               |   32768 |    2 | thinkpad_acpi,i915                                                        |
| button              |   16384 |    1 | i915                                                                      |
| acpi_cpufreq        |   20480 |    1 |                                                                           |
| tpm_tis             |   16384 |    0 |                                                                           |
| tpm_tis_core        |   20480 |    1 | tpm_tis                                                                   |
| tpm                 |   36864 |    2 | tpm_tis,tpm_tis_core                                                      |
| sch_fq_codel        |   20480 |    3 |                                                                           |
| ip_tables           |   20480 |    0 |                                                                           |
| x_tables            |   20480 |    1 | ip_tables                                                                 |
| ext4                |  495616 |    3 |                                                                           |
| crc16               |   16384 |    1 | ext4                                                                      |
| jbd2                |   81920 |    1 | ext4                                                                      |
| fscrypto            |   24576 |    1 | ext4                                                                      |
| mbcache             |   16384 |    4 | ext4                                                                      |
| sd_mod              |   36864 |    5 |                                                                           |
| ata_generic         |   16384 |    0 |                                                                           |
| pata_acpi           |   16384 |    0 |                                                                           |
| serio_raw           |   16384 |    0 |                                                                           |
| atkbd               |   24576 |    0 |                                                                           |
| libps2              |   16384 |    2 | atkbd,psmouse                                                             |
| ata_piix            |   32768 |    4 |                                                                           |
| ahci                |   36864 |    0 |                                                                           |
| libahci             |   28672 |    1 | ahci                                                                      |
| libata              |  192512 |    5 | ahci,ata_piix,libahci,ata_generic,pata_acpi                               |
| uhci_hcd            |   40960 |    0 |                                                                           |
| scsi_mod            |  139264 |    2 | sd_mod,libata                                                             |
| sdhci_pci           |   28672 |    0 |                                                                           |
| ehci_pci            |   16384 |    0 |                                                                           |
| ehci_hcd            |   65536 |    1 | ehci_pci                                                                  |
| sdhci               |   40960 |    1 | sdhci_pci                                                                 |
| led_class           |   16384 |    3 | sdhci,input_leds,thinkpad_acpi                                            |
| mmc_core            |  118784 |    2 | sdhci,sdhci_pci                                                           |
| usbcore             |  184320 |    3 | ehci_hcd,uhci_hcd,ehci_pci                                                |
| usb_common          |   16384 |    1 | usbcore                                                                   |
| i8042               |   28672 |    0 |                                                                           |
| serio               |   20480 |    6 | serio_raw,atkbd,psmouse,i8042                                             |

